In [ ]:
#20241216 월

In [3]:
%pip install pandas

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (2.2.3)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from pandas) (2024.2)
Requirement already satisfied: numpy>=1.22.4; python_version < "3.11" in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from pandas) (2.0.2)
Requirement already satisfied: tzdata>=2022.7 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from pandas) (2024.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/gyeongmi/Library/Python/3.9/lib/python/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in /Users/gyeongmi/Library/Python/3.9/lib/python/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
WARNING: You are using pip version 20.2.3; however, version 24.3.1 is available.
You should consider upgrading via the '/usr/local/bin/python3.9 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd

In [89]:
growth = pd.Series([143, 150, 157, 160], index = ["2018", "2019", "2020", "2021"])
growth

2018    143
2019    150
2020    157
2021    160
dtype: int64

In [90]:
growth["2019"]

np.int64(150)

In [8]:
#DataFrame 방법1
index = ["2018", "2019", "2020", "2021"]
data = {
    "영희" : [143, 150, 157, 160],
    "철수" : [165, 172, 175, 180]
}
growth = pd.DataFrame(data, columns=["영희", "철수"], index = index)
growth

       영희   철수
2018  143  165
2019  150  172
2020  157  175
2021  160  180

In [16]:
#DataFrame 방법2
index = ["2018", "2019", "2020", "2021"]

Y = pd.Series([143, 150, 157, 160], index = index)
C = pd.Series([165, 172, 175, 180], index = index)

growth = pd.DataFrame({
    "영희":Y,
    "철수":C
})
growth

       영희   철수
2018  143  165
2019  150  172
2020  157  175
2021  160  180

In [18]:
print(growth.dtypes)

영희    int64
철수    int64
dtype: object

In [ ]:
growth.astype('float') #float 정수형

         영희     철수
2018  143.0  165.0
2019  150.0  172.0
2020  157.0  175.0
2021  160.0  180.0

In [22]:
growth.astype({'영희':float})

         영희   철수
2018  143.0  165
2019  150.0  172
2020  157.0  175
2021  160.0  180

In [25]:
pd.read_csv("1.csv")

    A   B  C
0  30  21  9

In [32]:
pd.read_csv("2.csv", index_col=0)

    A   B  C
0  30  21  9
1   2   3  1

In [33]:
print(growth)

       영희   철수
2018  143  165
2019  150  172
2020  157  175
2021  160  180

In [38]:
growth.to_csv("output.csv")

In [56]:
#특정 값만 출력 
index = ["2018", "2019", "2020", "2021"]

Y = pd.Series([143, 150, 157, 160], index = index)
C = pd.Series([165, 172, 175, 180], index = index)
S = pd.Series([167, 178, 179, 188], index = index)

growth = pd.DataFrame({
    "영희":Y,
    "철수":C,
    "영철":S
})
growth

       영희   철수   영철
2018  143  165  167
2019  150  172  178
2020  157  175  179
2021  160  180  188

In [57]:
growth["영희"]

2018    143
2019    150
2020    157
2021    160
Name: 영희, dtype: int64

In [58]:
#인덱스 값 설정 가능
growth["영희"][2:]

2020    157
2021    160
Name: 영희, dtype: int64

In [59]:
#iloc 첫번째 행을 의미한다. 
growth.iloc[0]

영희    143
철수    165
영철    167
Name: 2018, dtype: int64

In [60]:
#n번째 행,열만 표현하기 
growth.iloc[:2, :3]

       영희   철수   영철
2018  143  165  167
2019  150  172  178

In [67]:
growth.iloc[-2:]

       영희   철수   영철
2020  157  175  179
2021  160  180  188

In [74]:
growth.loc[["2018","2019"],["영희", "철수"]]

       영희   철수
2018  143  165
2019  150  172

In [79]:
#특정 coulm을 인덱스로 사용
growth.set_index("영희")

      철수   영철
영희
143  165  167
150  172  178
157  175  179
160  180  188

In [81]:
growth.loc[growth.영희>150]

       영희   철수   영철
2020  157  175  179
2021  160  180  188

In [83]:
index = ["영희", "철수", "수현"]
data = {
    "2019" : [143, 150, 153],
    "2020" : [165, 172, 155],
    "2021" : [170, 184, 157]
}
growth = pd.DataFrame(data, columns=["2019", "2020", "2021"], index = index)
growth

    2019  2020  2021
영희   143   165   170
철수   150   172   184
수현   153   155   157

In [87]:
#새로운 걸 추가
growth["2022"]=200
growth

    2019  2020  2021  2022
영희   143   165   170   200
철수   150   172   184   200
수현   153   155   157   200

In [88]:
growth["거꾸로"]=range(len(growth), 0, -1)
print(growth)

    2019  2020  2021  2022  거꾸로
영희   143   165   170   200    3
철수   150   172   184   200    2
수현   153   155   157   200    1